/* --------------------------------------------------------------------------------------------- */
// Приклади з конспекту
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Колекція значень властивості
/* --------------------------------------------------------------------------------------------- */
function getAllPropValues(propName) {
  const products = [
    { name: 'Radar', price: 1300, quantity: 4 },
    { name: 'Scanner', price: 2700, quantity: 3 },
    { name: 'Droid', price: 400, quantity: 7 },
    { name: 'Grip', price: 1200, quantity: 9 },
  ];

  let propValues = [];

  for (let product of products) {
    // Перелік ключей(властивостей) об'єкту
    const productKeys = Object.keys(product);
    // Якщо ключ властивості присутній в об'єкті
    if (productKeys.includes(propName)) {
      propValues.push(product[propName]);
    }
  }

  return propValues;
}

console.log('getAllPropValues');
console.log('category', getAllPropValues('category')); // []
console.log('name', getAllPropValues('name')); // ["Radar", "Scanner", "Droid", "Grip"]
console.log('price', getAllPropValues('price')); // [(1300, 2700, 400, 1200)]
console.log('quantity', getAllPropValues('quantity')); //  [(4, 3, 7, 9)]
/* ============================================================================================= */

/* ============================================================================================= */
// ЗАДАЧА - Вартість товару
/* --------------------------------------------------------------------------------------------- */
// Функція calculateTotalPrice(productName) приймає один параметр productName- назва товару. 
// Функція містить масив об'єктів products з такими властивостями, 
// як name — ім'я товару, price — ціна і quantity — кількість.
// Доповни код функції так, щоб вона повертала загальну вартість (ціна * кількість) товару 
// з таким ім'ям з масиву products.
// Якщо продукту з такою назвою немає, то функція повинна повертати рядок 
// "Product <productName> not found!" , де <productName> — це ім'я товару.
/* --------------------------------------------------------------------------------------------- */
console.log('ЗАДАЧА - Вартість товару');

function calculateTotalPrice(productName) {
  const products = [
    { name: 'Radar', price: 1300, quantity: 4 },
    { name: 'Scanner', price: 2700, quantity: 3 },
    { name: 'Droid', price: 400, quantity: 7 },
    { name: 'Grip', price: 1200, quantity: 9 },
  ];

  let totalPrice = 0;

  for (const product of products) {
    if (product.name === productName) {
      totalPrice = totalPrice + product.price * product.quantity;
    };
  }

  if (totalPrice === 0) {
    return `Product ${productName} not found!`;
  }

  return totalPrice;
}

console.log('Blaster', calculateTotalPrice('Blaster')); // "Product Blaster not found!"
console.log('Radar', calculateTotalPrice('Radar')); // 5200
console.log('Droid', calculateTotalPrice('Droid')); // 2800
console.log('Grip', calculateTotalPrice('Grip')); // 10800
console.log('Scanner', calculateTotalPrice('Scanner')); // 8100
/* ============================================================================================= */


/* ============================================================================================= */
// Методи об'єкта
/* --------------------------------------------------------------------------------------------- */
// До нас звернулася власниця крамниці зілля «У старої жаби» і замовила програму для ведення інвентарю. 
// Програма має додавати, видаляти, шукати та оновлювати зілля.
// Оголоси об'єкт atTheOldToad з наступними властивостями:
// potions — масив, де будуть зберігатися зілля. Нехай зараз він буде порожнім
// getPotions() — метод, який повертає рядок "List of all available potions"
// addPotion(potionName) — метод, який повертає рядок "Adding <potionName>", 
//                         де potionName — це значення параметра potionName
/* --------------------------------------------------------------------------------------------- */
const atTheOldToad = {
  potions: [],
  getPotions() {
    return "List of all available potions";
  },
  addPotion(potionName) {
    return `Adding ${potionName}`;
  },
};

console.log(atTheOldToad.getPotions()); // "List of all available potions"
console.log(atTheOldToad.addPotion("Power potion")); // "Adding Power potion"
/* ============================================================================================= */

/* ============================================================================================= */
// Доступ к объекту и его свойствам через ключевое слово this
/* --------------------------------------------------------------------------------------------- */
// Об'єкт atTheOldToad має наступні властивості:
// potions — масив рядків, з назвами зілль
// getPotions() — метод, який повертає рядок "List of all available potions"
// Зміни код метода об'єкта getPotions() так, щоб він повертав значення властивості potions
/* --------------------------------------------------------------------------------------------- */
const atTheOldToad1 = {
  potions: ["Speed potion", "Stone skin"],
  getPotions() {
    return this.potions;
  },
};

console.log("Старе Зілля - ", atTheOldToad1.getPotions()); // поточне значення властивості potions
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Зміна властивості за посиланням 
/* --------------------------------------------------------------------------------------------- */
// Об'єкт atTheOldToad має наступні властивості:
// potions — масив рядків, з назвами зілль
// getPotions() — метод, який повертає значення властивості potions
// addPotion() — метод, який приймає параметр рядок з назвою зілля potionName
// Зміни код методу addPotion(potionName) так, щоб він додавав зілля potionName в кінець масиву у властивості potions.
/* --------------------------------------------------------------------------------------------- */
const atTheOldToad2 = {
  potions: ["Speed potion", "Stone skin"],
  getPotions() {
    return this.potions;
  },
  addPotion(potionName) {
    this.potions.push(potionName);
  },
};

atTheOldToad2.addPotion("Invisibility"); // Додавання зілля
console.log("Нове Зілля - ", atTheOldToad2.getPotions()); // нове значення властивості potions
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Масив об’єктів в якості властивості об'єкта
/* --------------------------------------------------------------------------------------------- */
// Замовниця хоче, щоб кожне зілля було представлено не тільки ім'ям, але й ціною. 
// Тому зараз у властивості potions буде зберігатися масив об'єктів з властивостями name та price.

// Об'єкт atTheOldToad має наступні властивості:
// potions — масив рядків, з назвами зілль
// getPotions() — метод, який повертає значення властивості potions
// addPotion() — метод, який приймає параметр об'єкт нового зілля newPotion і додає його в кінець масиву у властивості potions.
// Додай метод getTotalPrice(), який має повертати загальну вартість усіх зілль з властивості potions.
/* --------------------------------------------------------------------------------------------- */
const atTheOldToad3 = {
  potions: [
    { name: "Speed potion", price: 460 },
    { name: "Stone skin", price: 520 },
  ],
  getPotions() {
    return this.potions;
  },
  addPotion(newPotion) {
    this.potions.push(newPotion);
  },
  getTotalPrice() {
    let totalPrice = 0;
    for (const potion of this.potions) {
      totalPrice = totalPrice + potion.price;
    }
    return totalPrice;
  },
};

atTheOldToad3.addPotion({ name: "Power potion", price: 270 }); // Додавання нового зілля
console.log("Всі Зілля - ", atTheOldToad3.getPotions()); // значення властивості potions
console.log("Вартість -", atTheOldToad3.getTotalPrice()); // вартість усіх зілль з властивості potions
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Зміна об'єкта в масиві
/* --------------------------------------------------------------------------------------------- */
// Об'єкт atTheOldToad має наступні властивості:
// potions — масив об'єктів зілль
// getPotions() — метод, який повертає значення властивості potions
// updatePotionName() — метод, який приймає два параметра рядків oldName і newName
// Доповни метод updatePotionName(oldName, newName) таким чином, 
// щоб він оновлював назву зілля з oldName на newName в масиві зілля у властивості potions.
/* --------------------------------------------------------------------------------------------- */
const atTheOldToad4 = {
  potions: [
    { name: "Speed potion", price: 460 },
    { name: "Stone skin", price: 520 },
  ],
  getPotions() {
    return this.potions;
  },
  updatePotionName(oldName, newName) {
    for (const potion of this.potions) {
      if (potion.name === oldName) {
        potion.name = newName;
      }
    }
  },
};

atTheOldToad4.updatePotionName("Stone skin", "Invisibility");
console.log("Всі Зілля - ", atTheOldToad4.getPotions()); // значення властивості potions
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Синтаксис spread і rest
/* ============================================================================================= */

/* ============================================================================================= */
// Залишкові параметри ...rest
/* --------------------------------------------------------------------------------------------- */
// Використовуючи синтаксис залишкових параметрів, доповни код функції add() так, 
// щоб вона приймала будь-яку кількість аргументів у параметр args і повертала їхню суму.
/* --------------------------------------------------------------------------------------------- */
console.log('Залишкові параметри ...rest');

function add(...args) {
  let sumArgs = 0;
  for (let arg of args) {
    sumArgs = sumArgs + arg ;
  }
  return sumArgs;
}
console.log(add(12, 4, 11, 48)); // 75
console.log(add(32, 6, 13, 19, 8)); // 78
console.log("-".repeat(40));
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Збір частини аргументів
/* --------------------------------------------------------------------------------------------- */
// Функція addOverNum() приймає довільну кількість аргументів чисел.
// Доповни код функції таким чином, щоб вона обчислювала суму тільки тих аргументів, 
// які більші за задане число. Це число завжди буде передано першим аргументом.
// Перший параметр value повинен представляти задане число, 
// а решта аргументів повинні бути зібрані за допомогою синтаксису (...args)
/* --------------------------------------------------------------------------------------------- */
console.log('Збір частини аргументів ...rest');

function addOverNum(value, ...args) {
  let sumArgs = 0;
  for (const arg of args) {
    if (arg > value) {
      sumArgs = sumArgs + arg;
    }
  }
  return sumArgs;
}

console.log(addOverNum(50, 15, 27));                  //  0
console.log(addOverNum(10, 12, 4, 11, 48, 10, 8));    //  71
console.log(addOverNum(15, 32, 6, 13, 19, 8));        //  51
console.log(addOverNum(20, 74, 11, 62, 46, 12, 36));  //  218
console.log("-".repeat(40));
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Оператор розпилення ...spread
/* --------------------------------------------------------------------------------------------- */
// Функція getExtremeScores(scores) приймає масив оцінок (чисел) у параметрі scores.
// Доповни код функції так, щоб вона повертала об'єкт із двома властивостями:
// Властивість best має містити найбільше число з масиву scores
// Властивість worst має містити найменше число з масиву scores.
// Використовуй оператор (...spread) і методи Math.max() і Math.min().
/* --------------------------------------------------------------------------------------------- */
console.log('Оператор розпилення ...spread');

function getExtremeScores(scores) {
  return {
    best: Math.max(...scores),
    worst: Math.min(...scores),
  };
}

console.log(getExtremeScores([89, 64, 42, 17, 93, 51, 26])); // { best: 93, worst: 17 }
console.log(getExtremeScores([19, 7, 4, 17, 81, 24])); // { best: 81, worst: 4 }

console.log("-".repeat(40));
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Створення копії масиву / "Склеювання" массивів - оператор розпилення ...spread
/* --------------------------------------------------------------------------------------------- */
// У змінних firstGroupScores, secondGroupScores і thirdGroupScores зберігаються результати 
// тестування окремих груп. Використовуючи розпилення, доповни код таким чином, щоб:
//    У змінній allScores зберігався масив всіх результатів від першої до третьої групи включно.
//    У змінній bestScore був найвищий загальний бал.
//    У змінній worstScore був найнижчий загальний бал.
/* --------------------------------------------------------------------------------------------- */
console.log('Створення копії масиву / "Склеювання" массивів - оператор розпилення ...spread');

const firstGroupScores = [64, 42, 93];
const secondGroupScores = [89, 14, 51, 26];
const thirdGroupScores = [29, 47, 18, 97, 81];

const allScores = [...firstGroupScores,...secondGroupScores,...thirdGroupScores];
const bestScore = Math.max(...allScores);
const worstScore = Math.min(...allScores);

console.log('allScores', allScores); // [64, 42, 93, 89, 14, 51, 26, 29, 47, 18, 97, 81]
console.log('bestScore', bestScore); // 97
console.log('worstScore', worstScore); // 14

console.log("-".repeat(40));
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Створення об'єкта - оператор розпилення ...spread
/* --------------------------------------------------------------------------------------------- */
// В конструкторі можна створювати нові тести, для яких є налаштування за замовчуванням, 
// які зберігаються у змінній defaultSettings. 
// Під час створення тесту, усі або частину налаштувань можна перевизначити, 
// користувацькі налаштування зберігаються у змінній overrideSettings.

// Для того щоб отримати фінальні налаштування тесту, необхідно взяти налаштування за замовчуванням
// і поверх них застосувати перевизначені користувацькі налаштування. 
// Доповни код таким чином, щоб у змінній finalSettings утворився об'єкт фінальних налаштувань тесту.
/* --------------------------------------------------------------------------------------------- */
console.log(`Створення об'єкта - оператор розпилення ...spread`);

const defaultSettings = {
  theme: "light",
  public: true,
  withPassword: false,
  minNumberOfQuestions: 10,
  timePerQuestion: 60,
};
const overrideSettings = {
  public: false,
  withPassword: true,
  timePerQuestion: 30,
};

const finalSettings = {...defaultSettings, ...overrideSettings};

console.log('finalSettings', finalSettings);

console.log("-".repeat(40));
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// 
/* --------------------------------------------------------------------------------------------- */
// 
/* --------------------------------------------------------------------------------------------- */


/* ============================================================================================= */
// 
/* --------------------------------------------------------------------------------------------- */
// 
/* --------------------------------------------------------------------------------------------- */