// Задача 2. Розрахунок калорій

/* ============================================================================================= */
// Напиши функцію calcAverageCalories(days), 
// яка повертає середньодобове значення кількості калорій, які спортсмен споживав протягом тижня.
/* ============================================================================================= */

/* --------------------------------------------------------------------------------------------- */
// Функція очікує один параметр: days — масив об’єктів. 

// Кожен об’єкт описує день тижня та кількість калорій calories, спожитих спортсменом, у цей день..
/* --------------------------------------------------------------------------------------------- */

function calcAverageCalories(days) {
  // Кількість днів - довжина масива
  const lenDays = days.length;

  // Якщо пустий масив, то повертаємо 0
  if (lenDays === 0) {
    return 0;
  }

  // Загальна кількість калорій
  let sumCalories = 0;
  // Перебираємо масив об'єктів
  for (const day of days) {
    sumCalories += day.calories;
  }

  // Середньодобова кількість калорій (округлюємо до цілого числа)
  return Math.round(sumCalories/lenDays);
}
/* --------------------------------------------------------------------------------------------- */

/* ============================================================================================= */
// Перевірка
/* ============================================================================================= */
console.log(
  calcAverageCalories([
    { day: "monday", calories: 3010 },
    { day: "tuesday", calories: 3200 },
    { day: "wednesday", calories: 3120 },
    { day: "thursday", calories: 2900 },
    { day: "friday", calories: 3450 },
    { day: "saturday", calories: 3280 },
    { day: "sunday", calories: 3300 }
  ])
); // 3180

console.log(
  calcAverageCalories([
    { day: "monday", calories: 2040 },
    { day: "tuesday", calories: 2270 },
    { day: "wednesday", calories: 2420 },
    { day: "thursday", calories: 1900 },
    { day: "friday", calories: 2370 },
    { day: "saturday", calories: 2280 },
    { day: "sunday", calories: 2610 }
  ])
); // 2270

console.log(
  calcAverageCalories([])
); // 0

/* ============================================================================================= */
